#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
fortimanager_system_global.workspace: Refreshing state... [id=SystemGlobal]
fortimanager_dvm_cmd_update_device.refreshDevice: Refreshing state... [id=DvmCmdUpdateDevice]
fortimanager_object_fmg_variable.createMetadata["loopback"]: Refreshing state... [id=loopback]
fortimanager_object_fmg_variable.createMetadata["mpls_wan_ip"]: Refreshing state... [id=mpls_wan_ip]
fortimanager_object_fmg_variable.createMetadata["inbandwidth"]: Refreshing state... [id=inbandwidth]
fortimanager_object_fmg_variable.createMetadata["region"]: Refreshing state... [id=region]
fortimanager_object_fmg_variable.createMetadata["profile"]: Refreshing state... [id=profile]
fortimanager_object_fmg_variable.createMetadata["outbandwidth"]: Refreshing state... [id=outbandwidth]
fortimanager_object_fmg_variable.createMetadata["mpls_wan_gateway"]: Refreshing state... [id=mpls_wan_gateway]
fortimanager_object_fmg_variable.createMetadata["hostname"]: Refreshing state... [id=hostname]
fortimanager_object_fmg_variable.createMetadata["lan_ip_fin"]: Refreshing state... [id=lan_ip_fin]
fortimanager_object_fmg_variable.createMetadata["shaping_profile"]: Refreshing state... [id=shaping_profile]
fortimanager_object_fmg_variable.createMetadata["lan_ip_edu"]: Refreshing state... [id=lan_ip_edu]
fortimanager_object_cli_template.Project: Refreshing state... [id=Project]
fortimanager_object_cli_template.Edge-Routing: Refreshing state... [id=03-Edge-Routing]
fortimanager_object_cli_template.Hub-MultiRegion: Refreshing state... [id=04-Hub-MultiRegion]
fortimanager_object_cli_template.Hub-Routing: Refreshing state... [id=03-Hub-Routing]
fortimanager_object_cli_template.Edge-Underlay: Refreshing state... [id=01-Edge-Underlay]
fortimanager_object_cli_template.Hub-Underlay: Refreshing state... [id=01-Hub-Underlay]
fortimanager_object_cli_template.Hub-Overlay: Refreshing state... [id=02-Hub-Overlay]
fortimanager_object_cli_template.Edge-Overlay: Refreshing state... [id=02-Edge-Overlay]
fortimanager_object_cli_templategroup.Edge-Template: Refreshing state... [id=Edge-Template]
fortimanager_object_cli_templategroup.Hub-Template: Refreshing state... [id=Hub-Template]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # fortimanager_dvm_cmd_update_device.refreshDevice will be updated in-place
  ~ resource "fortimanager_dvm_cmd_update_device" "refreshDevice" {
      ~ device  = "UpdatedFromTerra" -> "FortiGate-VM64-KVM"
        id      = "DvmCmdUpdateDevice"
        # (2 unchanged attributes hidden)
    }

  # fortimanager_exec_workspace_action.lockADOM will be created
  + resource "fortimanager_exec_workspace_action" "lockADOM" {
      + action         = "lockbegin"
      + adom           = "createdByTerraform"
      + force_recreate = (known after apply)
      + id             = (known after apply)
      + scopetype      = "adom"
    }

  # fortimanager_exec_workspace_action.unlockADOM will be created
  + resource "fortimanager_exec_workspace_action" "unlockADOM" {
      + action         = "lockend"
      + adom           = "createdByTerraform"
      + force_recreate = (known after apply)
      + id             = (known after apply)
      + scopetype      = "adom"
    }

  # fortimanager_json_generic_api.authDevice will be created
  + resource "fortimanager_json_generic_api" "authDevice" {
      + id           = (known after apply)
      + json_content = jsonencode(
            {
              + method = "exec"
              + params = [
                  + {
                      + data = {
                          + adom   = "createdByTerraform"
                          + device = {
                              + adm_pass        = ""
                              + adm_usr         = "admin"
                              + "device action" = "promote_unreg"
                              + name            = "FortiGate-VM64-KVM"
                              + platform_str    = "FortiGate-VM64-KVM"
                              + sn              = "FGVMEVDNB1HFA86B"
                            }
                          + flags  = [
                              + "create_task",
                            ]
                        }
                      + url  = "/dvm/cmd/add/device"
                    },
                ]
            }
        )
      + response     = (known after apply)
    }

  # fortimanager_json_generic_api.createADOM will be created
  + resource "fortimanager_json_generic_api" "createADOM" {
      + id           = (known after apply)
      + json_content = jsonencode(
            {
              + method = "add"
              + params = [
                  + {
                      + data = [
                          + {
                              + create_time                = 0
                              + desc                       = "Created By Terraform"
                              + flags                      = [
                                  + "no_vpn_console",
                                ]
                              + log_db_retention_hours     = 1440
                              + log_disk_quota             = 0
                              + log_disk_quota_alert_thres = 90
                              + log_disk_quota_split_ratio = 70
                              + log_file_retention_hours   = 8760
                              + mig_mr                     = 0
                              + mig_os_ver                 = 0
                              + mode                       = "gms"
                              + mr                         = 2
                              + name                       = "createdByTerraform"
                              + os_ver                     = "7.0"
                              + restricted_prds            = "fos"
                              + state                      = 1
                              + uuid                       = ""
                              + workspace_mode             = 1
                            },
                        ]
                      + url  = "/dvmdb/adom"
                    },
                ]
            }
        )
      + response     = (known after apply)
    }

  # fortimanager_json_generic_api.getADOM will be created
  + resource "fortimanager_json_generic_api" "getADOM" {
      + id           = (known after apply)
      + json_content = jsonencode(
            {
              + method = "get"
              + params = [
                  + {
                      + option = "{option}"
                      + url    = "/dvmdb/adom/createdByTerraform"
                    },
                ]
            }
        )
      + response     = (known after apply)
    }

  # fortimanager_json_generic_api.updateDeviceDB will be created
  + resource "fortimanager_json_generic_api" "updateDeviceDB" {
      + id           = (known after apply)
      + json_content = jsonencode(
            {
              + method = "update"
              + params = [
                  + {
                      + data = {
                          + adm_pass      = ""
                          + adm_usr       = "admin"
                          + desc          = "This is updated from Terrafrom using an API!"
                          + latitude      = 60.37309404359674
                          + longitude     = 5.33920881412722
                          + "meta fields" = {
                              + Address                = "Fjøsangerveien 65"
                              + "Company/Organization" = "Eviny Digital AS"
                              + "Contact Email"        = "ghaith.almujalled@verja.no"
                              + "Contact Phone Number" = "+4745402619"
                            }
                          + name          = "authByTerraform"
                        }
                      + url  = "/dvmdb/adom/createdByTerraform/device/FortiGate-VM64-KVM"
                    },
                ]
            }
        )
      + response     = (known after apply)
    }

  # fortimanager_object_cli_template.Project will be updated in-place
  ~ resource "fortimanager_object_cli_template" "Project" {
        id          = "Project"
        name        = "Project"
      ~ variables   = [
          + "hostname",
          + "loopback",
          + "mpls_wan_gateway",
          + "profile",
          + "region",
            # (6 unchanged elements hidden)
        ]
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + DeviceDB = (known after apply)
  + getADOM  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Almujalled, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*